src/main/java/ru/vk/itmo/test/vadimershov/wrk/result/upsert/20000/wrk_log.txt
./wrk -d 60 -t 1 -c 1 -R 20000 -L -s ./upsert.lua http://localhost:8080/v0/entry
Running 1m test @ http://localhost:8080/v0/entry
  1 threads and 1 connections
  Thread calibration: mean lat.: 7.413ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   619.81us  407.21us  12.32ms   71.06%
    Req/Sec    21.10k     1.36k   30.55k    70.62%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  613.00us
 75.000%    0.90ms
 90.000%    1.07ms
 99.000%    1.18ms
 99.900%    3.09ms
 99.990%   11.57ms
 99.999%   12.25ms
100.000%   12.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.028     0.000000            6         1.00
       0.153     0.100000       100124         1.11
       0.269     0.200000       200686         1.25
       0.384     0.300000       300633         1.43
       0.498     0.400000       400507         1.67
       0.613     0.500000       500478         2.00
       0.670     0.550000       550267         2.22
       0.728     0.600000       600574         2.50
       0.785     0.650000       649919         2.86
       0.843     0.700000       700313         3.33
       0.901     0.750000       750480         4.00
       0.930     0.775000       775587         4.44
       0.959     0.800000       800632         5.00
       0.987     0.825000       825177         5.71
       1.016     0.850000       850605         6.67
       1.045     0.875000       875656         8.00
       1.059     0.887500       888014         8.89
       1.073     0.900000       900567        10.00
       1.086     0.912500       912489        11.43
       1.100     0.925000       925144        13.33
       1.114     0.937500       937749        16.00
       1.121     0.943750       943939        17.78
       1.128     0.950000       949962        20.00
       1.135     0.956250       956170        22.86
       1.142     0.962500       962447        26.67
       1.149     0.968750       968789        32.00
       1.153     0.971875       972356        35.56
       1.156     0.975000       975127        40.00
       1.159     0.978125       978031        45.71
       1.163     0.981250       981695        53.33
       1.166     0.984375       984371        64.00
       1.168     0.985938       985923        71.11
       1.171     0.987500       987893        80.00
       1.173     0.989062       988998        91.43
       1.177     0.990625       990658       106.67
       1.182     0.992188       992130       128.00
       1.186     0.992969       992939       142.22
       1.190     0.993750       993636       160.00
       1.197     0.994531       994471       182.86
       1.206     0.995313       995201       213.33
       1.220     0.996094       996000       256.00
       1.228     0.996484       996370       284.44
       1.238     0.996875       996779       320.00
       1.249     0.997266       997151       365.71
       1.264     0.997656       997545       426.67
       1.285     0.998047       997919       512.00
       1.303     0.998242       998117       568.89
       1.338     0.998437       998307       640.00
       1.537     0.998633       998501       731.43
       2.355     0.998828       998697       853.33
       3.235     0.999023       998892      1024.00
       3.413     0.999121       998990      1137.78
       4.151     0.999219       999087      1280.00
       5.287     0.999316       999185      1462.86
       6.083     0.999414       999283      1706.67
       7.163     0.999512       999380      2048.00
       7.627     0.999561       999429      2275.56
       8.311     0.999609       999478      2560.00
       9.079     0.999658       999527      2925.71
       9.831     0.999707       999576      3413.33
      10.583     0.999756       999624      4096.00
      10.951     0.999780       999649      4551.11
      11.143     0.999805       999673      5120.00
      11.279     0.999829       999699      5851.43
      11.383     0.999854       999722      6826.67
      11.527     0.999878       999747      8192.00
      11.559     0.999890       999762      9102.22
      11.591     0.999902       999772     10240.00
      11.711     0.999915       999783     11702.86
      11.815     0.999927       999795     13653.33
      11.911     0.999939       999808     16384.00
      11.935     0.999945       999815     18204.44
      11.983     0.999951       999821     20480.00
      12.023     0.999957       999826     23405.71
      12.079     0.999963       999832     27306.67
      12.135     0.999969       999843     32768.00
      12.135     0.999973       999843     36408.89
      12.143     0.999976       999844     40960.00
      12.151     0.999979       999847     46811.43
      12.183     0.999982       999850     54613.33
      12.223     0.999985       999853     65536.00
      12.239     0.999986       999856     72817.78
      12.239     0.999988       999856     81920.00
      12.247     0.999989       999858     93622.86
      12.255     0.999991       999859    109226.67
      12.263     0.999992       999861    131072.00
      12.279     0.999993       999862    145635.56
      12.279     0.999994       999862    163840.00
      12.287     0.999995       999864    187245.71
      12.287     0.999995       999864    218453.33
      12.303     0.999996       999865    262144.00
      12.303     0.999997       999865    291271.11
      12.303     0.999997       999865    327680.00
      12.311     0.999997       999866    374491.43
      12.311     0.999998       999866    436906.67
      12.319     0.999998       999867    524288.00
      12.319     0.999998       999867    582542.22
      12.319     0.999998       999867    655360.00
      12.319     0.999999       999867    748982.86
      12.319     0.999999       999867    873813.33
      12.327     0.999999       999868   1048576.00
      12.327     1.000000       999868          inf
#[Mean    =        0.620, StdDeviation   =        0.407]
#[Max     =       12.320, Total count    =       999868]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199954 requests in 1.00m, 76.67MB read
Requests/sec:  19999.64
Transfer/sec:      1.28MB